{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"output_shape_type": "raw", "name": "lambda_1", "input_dtype": "float32", "trainable": true, "output_shape": null, "arguments": {}, "batch_input_shape": [null, 21, 64, 3], "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u0000`@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-2-a505c191637f>\u00da\b<lambda>\u0006\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "batch_input_shape": [null, 21, 64, 3], "input_dtype": "float32", "trainable": true, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_col": 5, "init": "glorot_uniform", "nb_filter": 24, "border_mode": "valid", "bias": true, "subsample": [1, 1], "activation": "relu", "b_constraint": null, "nb_row": 5}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "batch_input_shape": [null, 21, 64, 3], "input_dtype": "float32", "trainable": true, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_col": 5, "init": "glorot_uniform", "nb_filter": 36, "border_mode": "valid", "bias": true, "subsample": [1, 1], "activation": "relu", "b_constraint": null, "nb_row": 5}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "batch_input_shape": [null, 21, 64, 3], "input_dtype": "float32", "trainable": true, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_col": 5, "init": "glorot_uniform", "nb_filter": 48, "border_mode": "valid", "bias": true, "subsample": [1, 1], "activation": "relu", "b_constraint": null, "nb_row": 5}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "batch_input_shape": [null, 21, 64, 3], "input_dtype": "float32", "trainable": true, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "init": "glorot_uniform", "nb_filter": 64, "border_mode": "valid", "bias": true, "subsample": [2, 2], "activation": "relu", "b_constraint": null, "nb_row": 3}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "batch_input_shape": [null, 21, 64, 3], "input_dtype": "float32", "trainable": true, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "init": "glorot_uniform", "nb_filter": 64, "border_mode": "valid", "bias": true, "subsample": [2, 2], "activation": "relu", "b_constraint": null, "nb_row": 3}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "input_dim": 768, "trainable": true, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "name": "dense_1", "bias": true, "output_dim": 1164, "activation": "relu", "b_constraint": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "input_dim": 1164, "trainable": true, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "name": "dense_2", "bias": true, "output_dim": 100, "activation": "relu", "b_constraint": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "input_dim": 100, "trainable": true, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "name": "dense_3", "bias": true, "output_dim": 50, "activation": "relu", "b_constraint": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "input_dim": 50, "trainable": true, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "name": "dense_4", "bias": true, "output_dim": 10, "activation": "relu", "b_constraint": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "input_dim": 10, "trainable": true, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "name": "dense_5", "bias": true, "output_dim": 1, "activation": "linear", "b_constraint": null}}]}