{"config": [{"config": {"name": "lambda_1", "batch_input_shape": [null, 21, 64, 3], "trainable": true, "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u0000`@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-3-53e0c0f504cf>\u00da\b<lambda>\u0002\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "output_shape": null, "output_shape_type": "raw", "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"activation": "relu", "b_regularizer": null, "nb_filter": 24, "trainable": true, "b_constraint": null, "nb_col": 5, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "valid", "name": "convolution2d_1", "batch_input_shape": [null, 21, 64, 3], "W_constraint": null, "bias": true, "subsample": [1, 1], "nb_row": 5, "input_dtype": "float32", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "b_regularizer": null, "nb_filter": 36, "trainable": true, "b_constraint": null, "nb_col": 5, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "valid", "name": "convolution2d_2", "batch_input_shape": [null, 21, 64, 3], "W_constraint": null, "bias": true, "subsample": [1, 1], "nb_row": 5, "input_dtype": "float32", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "b_regularizer": null, "nb_filter": 48, "trainable": true, "b_constraint": null, "nb_col": 5, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "valid", "name": "convolution2d_3", "batch_input_shape": [null, 21, 64, 3], "W_constraint": null, "bias": true, "subsample": [1, 1], "nb_row": 5, "input_dtype": "float32", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "b_regularizer": null, "nb_filter": 64, "trainable": true, "b_constraint": null, "nb_col": 3, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "valid", "name": "convolution2d_4", "batch_input_shape": [null, 21, 64, 3], "W_constraint": null, "bias": true, "subsample": [2, 2], "nb_row": 3, "input_dtype": "float32", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "b_regularizer": null, "nb_filter": 64, "trainable": true, "b_constraint": null, "nb_col": 3, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "valid", "name": "convolution2d_5", "batch_input_shape": [null, 21, 64, 3], "W_constraint": null, "bias": true, "subsample": [2, 2], "nb_row": 3, "input_dtype": "float32", "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "relu", "b_regularizer": null, "trainable": true, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_1", "input_dim": 768, "bias": true, "output_dim": 1164}, "class_name": "Dense"}, {"config": {"activation": "relu", "b_regularizer": null, "trainable": true, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_2", "input_dim": 1164, "bias": true, "output_dim": 100}, "class_name": "Dense"}, {"config": {"activation": "relu", "b_regularizer": null, "trainable": true, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_3", "input_dim": 100, "bias": true, "output_dim": 50}, "class_name": "Dense"}, {"config": {"activation": "relu", "b_regularizer": null, "trainable": true, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_4", "input_dim": 50, "bias": true, "output_dim": 10}, "class_name": "Dense"}, {"config": {"activation": "linear", "b_regularizer": null, "trainable": true, "b_constraint": null, "W_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_5", "input_dim": 10, "bias": true, "output_dim": 1}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}